#include "Graph.h"

int main() {
    /*
     * Graph კლასში ინკაფსულირებულია
     * რვინის ამოცანის გადაჭრის საშუალებები
     */
    Graph graph;

    // setGoalState მეთოდით ვანიჭებთ გრაფს საძიებო მიზნის მდგომარეობას
    graph.setGoalState(vector<int> {
        1, 2, 3,
        8, 0, 4,
        7, 6, 5
    });

    /*
     * solve მეთოდი ღებულობს საწყის მდგომარეობას
     * ანუ ამოცანას პირველ არგუმენტად, და მეორე არგუმენტად
     * გადაეცემა ამოხსნის მეთოდი (true_ს შემთხვევაში
     * ამოცანა იჭრება A* ალგორითმის მეშვეობით ანუ ევრისტიკული
     * ფუნქციის დახმარებით, false_ის შემთხვევაში კი ამოცანა იხსნება
     * სრული გადარჩევით განივი ძებნის ალგორითმით).
     * */
    graph.solve(vector<int> {
        2, 8, 3,
        1, 6, 4,
        7, 0, 5
    }, true);

    return 0;
}
